{
  "projects": [
    {
      "title": "Home Lab",
      "shortDesc": "Due to the COVID-19 pandemic and the shift to a work-from-home environment for my family, I set out to establish a robust and scalable network and home lab. The setup is complete with a NAS, a media server, a game host server, and smart home automation control system.",
      "tags": ["IT", "Networking", "Linux"],
      "headerImg": "/images/projects/homelab.jpg"
    },
    {
      "title": "LabLink",
      "shortDesc": "Developed a universal method for lab students to request assistance from a teaching assistant (TA). Simplify the process for the TA to manage the queue of users in real time.",
      "buttonText": "Visit Repository",
      "buttonLink": "https://github.com/LabLinkSCU/LabLinkSW",
      "tags": ["Software", "C", "Embedded Systems", "STM32"],
      "headerImg": "/images/projects/lablink.png"
    },
    {
      "title": "The Bridge",
      "shortDesc": "Visualize songs in real time on a beautifully crafted model bridge.",
      "buttonText": "Visit Repository",
      "buttonLink": "https://github.com/Saamstep/Bridge/wiki",
      "tags": ["Software", "C", "Embedded Systems", "STM32"],
      "headerImg": "/images/projects/bridge.png"
    },
    {
      "title": "ModMail Bot",
      "shortDesc": "I’m passionate about creating utility-focused Discord bots that assist server administrators and staff in performing their tasks efficiently, promptly, and systematically. This system has proven instrumental in helping me and numerous staff members manage support requests effortlessly within the Discord platform.",
      "buttonText": "Visit Repository",
      "buttonLink": "https://github.com/saamstep/modmail#readme",
      "tags": ["Software", "NodeJS"],
      "headerImg": "/images/projects/modmail.png"
    },
    {
      "title": "VoxArt",
      "shortDesc": "Utilizing hand movements to control digital audio effects. Giving artistic expression into the hands of the vocalist as a conductor is to an orchestra emphasizing vocals with hand movements. With simple, easy to use off the shelf hardware, alter audio effect parameters using a closed loop control system.",
      "tags": ["Software", "C", "Embedded Systems", "STM32"],
      "headerImg": "/images/projects/voxart.png"
    },
    {
      "title": "Broadcast",
      "shortDesc": "I have experience with broadcast signal flows in remote and in-person production environments. I mainly have gathered my experience through esports and HOW shows. I especially enjoy camera operating, lighting and technical directing.",
      "tags": ["Control Room", "Operator", "Live Show"],
      "headerImg": "/images/projects/rp120.jpg"
    }
  ]
}
